# StructuralSectionSigmaProfileWithFold Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionSigmaProfileWithFold Class
Members See Also
---
Defines parameters for structural Sigma profile section with fold.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class StructuralSectionSigmaProfileWithFold : StructuralSectionColdFormed
```

Visual Basic
---
```text
Public Class StructuralSectionSigmaProfileWithFold _
	Inherits StructuralSectionColdFormed
```

Visual C++
---
```text
public ref class StructuralSectionSigmaProfileWithFold : public StructuralSectionColdFormed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionColdFormed Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionSigmaProfileWithFold
# See Also
StructuralSectionSigmaProfileWithFold Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace